In [2]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup 
import os
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import statistics

# Files to load
city_data_to_load = "ResourCes/city_data.csv"
ride_data_to_load = "ResourCes/ride_data.csv"

In [3]:
# Read the city data file and store it in a pandas DataFrame.
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [4]:
# Read the ride data file and store it in a pandas DataFrame.
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df.head(10)

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344
5        South Latoya  2019-03-11 12:26:48   9.52  1994999424437
6       New Paulville  2019-02-27 11:17:56  43.25   793208410091
7        Simpsonburgh  2019-04-26 00:43:24  35.98   111953927754
8     South Karenland  2019-01-08 03:28:48  35.09  7995623208694
9       North Jasmine  2019-03-09 06:26:29  42.81  5327642267789

In [5]:
# Ger the columns and the rows that are not null
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [6]:
# Get the colums and the rows that are not null
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [7]:
# Get the data types of each column
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [9]:
# Get the unique values of the type of city.
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [11]:
# Get the number of data points from the Urban cities
sum(city_data_df["type"]=="Urban")

66

In [12]:
# Get the number of data points from the Suburban cities
sum(city_data_df["type"]=="Suburban")

36

In [13]:
# Get the number of data points from the Rural cities
sum(city_data_df["type"]=="Rural")

18

In [33]:
# Get columns and the rows that not nulls
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [34]:
# Get the data types of each column
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [48]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how='right', on=["city", "city"])
pyber_data_df
# city_data_df
# Display the the DataFrame

,city,date,fare,ride_id,driver_count,type
0,Richardfort,2019-02-24 08:40:38,13.93,5628545007794,38,Urban
1,Richardfort,2019-02-13 12:46:07,14.00,910050116494,38,Urban
2,Richardfort,2019-02-16 13:52:19,17.92,820639054416,38,Urban
3,Richardfort,2019-02-01 20:18:28,10.26,9554935945413,38,Urban
4,Richardfort,2019-04-17 02:26:37,23.00,720020655850,38,Urban
...,...,...,...,...,...,...
2370,Jessicaport,2019-01-31 17:57:25,58.29,623154556195,1,Rural
2371,South Saramouth,2019-02-20 16:32:36,44.29,3622365199969,7,Rural
2372,South Saramouth,2019-01-28 15:55:33,31.25,7118046558393,7,Rural
2373,South Saramouth,2019-03-27 21:07:16,11.87,170351888128,7,Rural
2374,South Saramouth,2019-04-12 18:11:50,57.23,5081198789583,7,Rural

In [51]:
pyber_data_df = pd.merge(ride_data_df, city_data_df, how='left', on=["city", "city"])
pyber_data_df

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban
...,...,...,...,...,...,...
2370,Michaelberg,2019-04-29 17:04:39,13.38,8550365057598,6,Rural
2371,Lake Latoyabury,2019-01-30 00:05:47,20.76,9018727594352,2,Rural
2372,North Jaime,2019-02-10 21:03:50,11.11,2781339863778,1,Rural
2373,West Heather,2019-05-07 19:22:15,44.94,4256853490277,4,Rural
2374,Newtonview,2019-04-25 10:20:13,55.84,9990581345298,1,Rural